In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.DataFrame(np.arange(0,20).reshape(5,4),index=['ROw1','ROw2','Row3','Row4','Row5'],columns=['col1','col2','col3','col4'])

In [3]:
df

      col1  col2  col3  col4
ROw1     0     1     2     3
ROw2     4     5     6     7
Row3     8     9    10    11
Row4    12    13    14    15
Row5    16    17    18    19

In [4]:
df.to_csv('Test1.csv')

In [5]:
df.loc['ROw1']

col1    0
col2    1
col3    2
col4    3
Name: ROw1, dtype: int32

In [6]:
type(df.loc['ROw1'])

pandas.core.series.Series

In [7]:
df.shape

(5, 4)

In [8]:
df.iloc[:,:]

      col1  col2  col3  col4
ROw1     0     1     2     3
ROw2     4     5     6     7
Row3     8     9    10    11
Row4    12    13    14    15
Row5    16    17    18    19

In [9]:
df.iloc[0:3,:]

      col1  col2  col3  col4
ROw1     0     1     2     3
ROw2     4     5     6     7
Row3     8     9    10    11

In [10]:
df.iloc[0:3,0:2]

      col1  col2
ROw1     0     1
ROw2     4     5
Row3     8     9

In [11]:
type(df.iloc[0:3,0:2])

pandas.core.frame.DataFrame

In [12]:
df.iloc[:,1:]

      col2  col3  col4
ROw1     1     2     3
ROw2     5     6     7
Row3     9    10    11
Row4    13    14    15
Row5    17    18    19

In [13]:
df.iloc[:,:].values

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19]])

In [14]:
df.iloc[:,:].values.shape

(5, 4)

In [19]:
df['col1']

ROw1     0
ROw2     4
Row3     8
Row4    12
Row5    16
Name: col1, dtype: int32

In [20]:
df[['col1','col3']]

      col1  col3
ROw1     0     2
ROw2     4     6
Row3     8    10
Row4    12    14
Row5    16    18

In [15]:
df['col1'].value_counts()

0     1
8     1
4     1
16    1
12    1
Name: col1, dtype: int64

In [17]:
df['col1'].unique()

array([ 0,  4,  8, 12, 16])

In [16]:
df.isnull().sum()

col1    0
col2    0
col3    0
col4    0
dtype: int64